import React from 'react'
import './Icons.scss'

const svgIcon = icon => {
  switch (icon) {
    case 'Wizard':
      return (
        <svg width="35" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 45.28 44.66">
          <g data-name="Слой 2">
            <path d="M36.24 20.84H9A6.21 6.21 0 0 1 9 8.42h22.42a7 7 0 1 0 0-2.83H9a9 9 0 0 0 0 18.08h27.2a6.21 6.21 0 1 1 0 12.41H13.82a7 7 0 1 0 .06 2.83h22.36a9 9 0 1 0 0-18.08zm2-18A4.17 4.17 0 1 1 34.11 7a4.17 4.17 0 0 1 4.17-4.17zM7 41.83a4.17 4.17 0 0 1 0-8.33 4.13 4.13 0 0 1 4.16 4 1.18 1.18 0 0 0 0 .13A4.17 4.17 0 0 1 7 41.83z" fill="#fff" data-name="Слой 1" />
          </g>
        </svg>
      )
      break
    case 'Product':
      return (
        <svg width="35" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 46.71 46.71" >
          <g id="Слой_2" data-name="Слой 2">
            <g id="Слой_1-2" data-name="Слой 1">
              <path className="cls-2" d="M39.65 0H7.06A7.07 7.07 0 0 0 0 7.06v32.59a7.07 7.07 0 0 0 7.06 7.06h32.59a7.07 7.07 0 0 0 7.06-7.06V7.06A7.07 7.07 0 0 0 39.65 0zm4.23 7.06v14.88H24.77V2.83h14.88a4.23 4.23 0 0 1 4.23 4.23zM7.06 2.83h14.88v19.1H2.83V7.06a4.23 4.23 0 0 1 4.23-4.23zM2.83 39.65V24.77h19.1v19.1H7.06a4.23 4.23 0 0 1-4.23-4.22zm36.81 4.23H24.77V24.77h19.1v14.88a4.23 4.23 0 0 1-4.22 4.23z" fill="#fff" />
              <path className="cls-2" d="M11.29 11.04v5.8H13v-8h-1.49l-2.52 2.54.97 1.01 1.33-1.35zM32.22 11.16a2.86 2.86 0 0 1 2.15-.92c.66 0 1.3.35 1.3 1 0 1-1 1.81-4.23 4.23v1.33h6v-1.5h-3.26c2.07-1.51 3.2-2.7 3.2-4.07 0-1.6-1.36-2.55-3.06-2.55A4.08 4.08 0 0 0 31.24 10zM13.54 33.72a2 2 0 0 0 1.75-1.82c0-1.33-1.15-2.17-3-2.17A3.94 3.94 0 0 0 9.21 31l.85 1.07a2.88 2.88 0 0 1 2-.83c.84 0 1.49.31 1.49.95S13 33 12.1 33h-1v1.54h1c1.12 0 1.61.29 1.61.92s-.54 1-1.51 1a3.18 3.18 0 0 1-2.2-.9l-.9 1.14a4 4 0 0 0 3.15 1.3c1.92 0 3.15-1 3.15-2.35a2 2 0 0 0-1.86-1.93zM36.69 29.84h-2.35l-3.18 5v1.34H35v1.66h1.7v-1.65h1v-1.5h-1zM35 34.69h-2.17L35 31.36z" fill="#fff" />
            </g>
          </g>
        </svg>
      )
      break
    case 'Search':
      return (
        <svg width="35" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 45.29 45.28">
          <g data-name="Слой 2">
            <g data-name="Слой 1">
              <path className="cls-2" d="M21.37 8.11A13.16 13.16 0 0 0 12 12a1.42 1.42 0 1 0 2 2 10.41 10.41 0 0 1 14.72 0 1.42 1.42 0 0 0 2-2 13.16 13.16 0 0 0-9.35-3.89z" fill="#fff" /><path className="cls-2" d="M44.88 42.87l-7.45-7.45a21.32 21.32 0 0 0-1-29.17 21.38 21.38 0 1 0-1.05 31.17l7.45 7.45a1.42 1.42 0 0 0 2-2zM8.26 34.46A18.53 18.53 0 0 1 34.47 8.25 18.53 18.53 0 0 1 8.26 34.46z" fill="#fff" />
            </g>
          </g>
        </svg>
      )
      break
    case 'Call':
      return (
        <svg width="28" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 34.38 48.26">
          <g data-name="Слой 2">
            <path className="cls-2" d="M34.28 39.18l-2.43-6V21a14.66 14.66 0 0 0-10-13.91V4.61a4.62 4.62 0 0 0-9.23 0v2.5A14.63 14.63 0 0 0 2.54 21v12.14l-2.43 6a1.42 1.42 0 0 0 1.31 1.95h10v1.34a5.8 5.8 0 0 0 11.6 0v-1.3H33a1.42 1.42 0 0 0 1.31-1.95zM15.41 4.61a1.78 1.78 0 0 1 3.56 0v1.86a14.91 14.91 0 0 0-3.56 0zm-1.08 4.94a12 12 0 0 1 5.72 0A11.84 11.84 0 0 1 29 21v11H5.37V21a11.81 11.81 0 0 1 8.96-11.45zm5.83 32.92a3 3 0 0 1-5.93 0v-1.34h5.93zm1.45-4.17H3.52l1.39-3.46h24.56l1.39 3.46z" fill="#fff" data-name="Слой 1" />
          </g>
        </svg>
      )
      break
    case 'Promo':
      return (
        <svg width="30" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 35.71 41.83">
          <g data-name="Слой 2">
            <g data-name="Слой 1">
              <path className="cls-2" d="M25.11 24.41h-14.5a1.42 1.42 0 0 0 0 2.83h14.5a1.42 1.42 0 0 0 0-2.83zm0-6.57h-14.5a1.42 1.42 0 0 0 0 2.83h14.5a1.42 1.42 0 0 0 0-2.83zm0 12.65h-14.5a1.42 1.42 0 0 0 0 2.83h14.5a1.42 1.42 0 0 0 0-2.83zM6.44 5.19a1.42 1.42 0 1 0 0 2.81h25a1.42 1.42 0 1 0 0-2.83z" fill="#fff" /><path className="cls-2" d="M34.3 10.64H6.74A3.88 3.88 0 0 1 4 9.49a3.84 3.84 0 0 1-1.17-2.75 3.91 3.91 0 0 1 3.9-3.9H34.3a1.42 1.42 0 1 0 0-2.84H6.74A6.74 6.74 0 0 0 0 6.74v26.18a8.92 8.92 0 0 0 8.91 8.91H34.3a1.42 1.42 0 0 0 1.42-1.42V12.06a1.42 1.42 0 0 0-1.42-1.42zM8.91 39a6.08 6.08 0 0 1-6.08-6.08v-20.7a6.67 6.67 0 0 0 3.9 1.25h26.15V39z" fill="#fff" />
            </g>
          </g>
        </svg>
      )
      break
  }
}
const Icons = props => {

  return (
    <div className='row' onClick={props.handleClick}>
      <div id='left_icon' className='icon_col'>
        <div className="icon">
          {svgIcon(props.icon)}
        </div>
      </div>
      <div id='right_icon' className='icon_col'>
        <div className="title">
          {props.label}
        </div>
      </div>
    </div>
  )
}



export default Icons
